viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_mousejack.cpp
        mj_parseDuckyLine(line, target);
        lastLine = line;

        if (defaultDelayMs > 0) delay(defaultDelayMs);
    }

    file.close();
    NRFradio.powerDown();
    displaySuccess("Script complete", true);
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ TARGET LIST & ATTACK MENU ═════════════════════
// ══════════════════════════════════════════════════════════════════

static void mj_attackMenu(int targetIndex) {
    const MjTarget &target = mj_targets[targetIndex];

    options = {
        {"Inject String", [&]() { mj_attackString(targetIndex); }},
        {"DuckyScript",   [&]() { mj_attackDucky(targetIndex); } },
        {"Back",          [=]() { /* return */ }                 },
    };

    String title = String("[") + mj_getTypeLabel(target.type) + "] " + mj_formatAddr(target);
    loopOptions(options, MENU_TYPE_SUBMENU, title.c_str());
}

static void mj_targetListMenu() {
    if (mj_targetCount == 0) {
        displayWarning("No targets found", true);
        return;
    }

    bool inList = true;
    while (inList) {
        options.clear();
        for (int i = 0; i < mj_targetCount; i++) {
            String label = String("[") + mj_getTypeLabel(mj_targets[i].type) + "] " +
                           mj_formatAddr(mj_targets[i]) + " ch" + String(mj_targets[i].channel);
            int idx = i;
            options.push_back({label.c_str(), [idx]() { mj_attackMenu(idx); }});
        }
        options.push_back({"Rescan", [&]() { mj_scan(); }});
        options.push_back({"Back", [&]() { inList = false; }});

        loopOptions(options, MENU_TYPE_SUBMENU, "Targets");
        if (returnToMenu) return;
    }
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ MAIN MOUSEJACK MENU ══════════════════════════
// ══════════════════════════════════════════════════════════════════

void nrf_mousejack() {
    options = {
        {"Set NRF Mode",
         [=]() {
             NRF24_MODE selected = nrf_setMode();
             if (selected != NRF_MODE_DISABLED) mj_nrfMode = selected;
         }                                             },
        {"Scan Devices",
         [=]() {
             if (mj_scan()) {
                 mj_targetListMenu();
             } else {
                 displayInfo("No devices found", true);
             }
         }                                             },
        {"View Targets", [=]() { mj_targetListMenu(); }},
        {"Main Menu",    [=]() { returnToMenu = true; }},
    };

    loopOptions(options, MENU_TYPE_SUBMENU, "MouseJack");
}
#endif
